INSERT INTO type(name)
VALUES ('СЫР'),
       ('МОЛОКО'),
       ('ХЛЕБ');
insert into product(name, type_id, expired_date, price)
values ('Плавленный сыр', 1, '2024-05-20', 100),
       ('Сыр Моцарелла', 1, '2024-06-30', 150),
       ('Сырок Дружба', 1, '2024-07-25', 50),
       ('Мороженое ванильное', 2, '2024-05-31', 95),
       ('Мороженое Лакомка', 2, '2024-05-31', 70),
       ('Молоко', 2, '2024-05-31', 80),
       ('Кефир', 2, '2024-06-30', 90),
       ('Сливки', 2, '2024-08-31', 250),
       ('Хлеб Бородинский', 3, '2024-07-10', 35),
       ('Хлеб Нарезной', 3, '2024-06-25', 56),
       ('Хлеб Нарезной', 3, '2024-06-25', 56),
       ('Хлеб Нарезной', 3, '2024-06-28', 56),
       ('Хлеб Дарницкий', 3, '2024-07-01', 44),
       ('Хлеб Дарницкий', 3, '2024-07-02', 44),
       ('Рулет маковый', 3, '2024-09-19', 250);
