CREATE TABLE company
(
    id   integer NOT NULL,
    name character varying,
    CONSTRAINT company_pkey PRIMARY KEY (id)
);

CREATE TABLE person
(
    id         integer NOT NULL,
    name       character varying,
    company_id integer references company (id),
    CONSTRAINT person_pkey PRIMARY KEY (id)
);




-- Заполнение таблицы company
INSERT INTO company (id, name)
VALUES (1, 'ООО Альфа'),
       (2, 'ЗАО Бета'),
       (3, 'ООО Гамма'),
       (4, 'ЗАО Дельта'),
       (5, 'ООО Эпсилон'),
       (6, 'ОАО Зета'),
       (7, 'ЗАО Этаж'),
       (8, 'ООО Иллюзион'),
       (9, 'ОАО Комплекс'),
       (10, 'ЗАО Орбита');

-- Заполнение таблицы person
INSERT INTO person (id, name, company_id)
VALUES (1, 'Иванов Иван', 1),
       (2, 'Петров Петр', 1),
       (3, 'Сидоров Алексей', 1),
       (4, 'Федоров Михаил', 2),
       (5, 'Кузнецов Николай', 2),
       (6, 'Попов Дмитрий', 2),
       (7, 'Смирнов Андрей', 3),
       (8, 'Морозов Евгений', 3),
       (9, 'Волков Сергей', 3),
       (10, 'Лебедев Владимир', 4),
       (11, 'Соболев Артем', 4),
       (12, 'Алексеев Павел', 4),
       (13, 'Трофимов Виктор', 5),
       (14, 'Карпов Максим', 5),
       (15, 'Медведев Алексей', 5),
       (16, 'Гордеев Олег', 6),
       (17, 'Никитин Егор', 6),
       (18, 'Лавров Антон', 6),
       (19, 'Орлов Роман', 7),
       (20, 'Фомин Илья', 7),
       (21, 'Титов Кирилл', 7),
       (22, 'Зайцев Григорий', 8),
       (23, 'Чернов Виталий', 8),
       (24, 'Фролов Аркадий', 8),
       (25, 'Мартынов Вадим', 9),
       (26, 'Ершов Олег', 9),
       (27, 'Крылов Леонид', 9),
       (28, 'Родионов Степан', 10),
       (29, 'Савин Денис', 10),
       (30, 'Шестаков Георгий', 10);

